posts/reactive-programming-learning-note/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " vocab="http://ogp.me/ns" lang="zh_cn">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width">
<title>Reactive Programming Learning Note | Abner Zheng's Blog</title>
<link href="../../assets/css/all.css" rel="stylesheet" type="text/css">
<link rel="stylesheet" href="//fonts.googleapis.com/css?family=PT+Serif:400,400italic,700%7CPT+Sans:400">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="https://abnerzheng.github.io/posts/reactive-programming-learning-note/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Abner Zheng">
<link rel="prev" href="../scalaxue-xi-bi-ji/" title="scala学习笔记" type="text/html">
<link rel="next" href="../scalas-types-of-types/" title="Scala's types of types(中文翻译)" type="text/html">
<meta property="og:site_name" content="Abner Zheng's Blog">
<meta property="og:title" content="Reactive Programming Learning Note">
<meta property="og:url" content="https://abnerzheng.github.io/posts/reactive-programming-learning-note/">
<meta property="og:description" content="学习一波马丁的Reactive Programming for Scala. Actor这种并发范式还是得学习一波的。






可扩展性


Scale up: 在多核系统中利用并行性

Scale out: 利用多服务器结点




可扩展性中重要的一点是：最少化共用的可修改状态, 而Scale out的重要一点是弹性和位置透明。




弹性


弹性指的是一个应用能快速从错误中回复过来.">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2018-02-08T15:44:22+08:00">
</head>
<body class="theme-base-08">
    <a href="#content" class="sr-only sr-only-focusable">跳到主内容</a>
    <!-- Target for toggling the sidebar `.sidebar-checkbox` is for regular
            styles, `#sidebar-checkbox` for behavior. -->
    <input type="checkbox" class="sidebar-checkbox" id="sidebar-checkbox"><!-- Toggleable sidebar --><div class="sidebar" id="sidebar">
        <div class="sidebar-item">
            <p>A reserved <a href="https://getnikola.com" target="_blank">Nikola</a> theme that places the utmost gravity on content with a hidden drawer. Made by <a href="https://twitter.com/mdo" target="_blank">@mdo</a> for Jekyll,
            ported to Nikola by <a href="https://twitter.com/ralsina" target="_blank">@ralsina</a>.</p>
        </div>
        
    <nav id="menu" role="navigation" class="sidebar-nav"><a class="sidebar-nav-item" href="../../archive.html">文章存档</a>
        <a class="sidebar-nav-item" href="../../categories/">标签</a>
        <a class="sidebar-nav-item" href="../../rss.xml">RSS 源</a>
    
    
    </nav>
</div>

    <!-- Wrap is the content to shift when toggling the sidebar. We wrap the
         content to avoid any CSS collisions with our real content. -->
    <div class="wrap">
      <div class="masthead">
        <div class="container">
          
    <h3 id="brand" class="masthead-title">
      <a href="https://abnerzheng.github.io/" title="Abner Zheng's Blog" rel="home">Abner Zheng's Blog</a>
    </h3>

        </div>
      </div>

      <div class="container content" id="content">
        
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="post-title p-name entry-title" itemprop="headline name"><a href="." class="u-url">Reactive Programming Learning Note</a></h1>

        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn">Abner Zheng</span></p>
            <p class="dateline"><a href="." rel="bookmark"><time class="post-date published dt-published" datetime="2018-02-08T15:44:22+08:00" itemprop="datePublished" title="2018-02-08 15:44">2018-02-08 15:44</time></a></p>
                <p class="commentline">
        


        </p>
</div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <p>
学习一波马丁的Reactive Programming for Scala. Actor这种并发范式还是得学习一波的。
</p>

<!--TEASER_END-->


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">可扩展性</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Scale up: 在多核系统中利用并行性
</li>
<li>Scale out: 利用多服务器结点
</li>
</ul>
<p>
可扩展性中重要的一点是：最少化共用的可修改状态, 而Scale out的重要一点是弹性和位置透明。
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">弹性</h3>
<div class="outline-text-3" id="text-1-1">
<p>
弹性指的是一个应用能快速从错误中回复过来.
</p>

<p>
这些错误包括:
</p>
<ul class="org-ul">
<li>软件错误
</li>
<li>硬件错误
</li>
<li>网络错误
</li>
</ul>
<p>
一般来说，弹性是不能之后添加的，必须是从起始就开始设计. 它需要架构是:
</p>
<ul class="org-ul">
<li>松耦合
</li>
<li>对状态的强封装
</li>
<li>无孔不入的监控体系
</li>
</ul>
<p>
响应式的应用可以使用事件驱动、可扩展和弹性架构来构建。
</p>
</div>

<div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1">Actor这种范式和JavaScript的有什么不同呢？</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
JavaScript这种有以下几个问题:
</p>

<ul class="org-ul">
<li>可能存在共享可修改状态
</li>
<li>不能被组合
</li>
<li>很容易导致回调地狱
</li>
</ul>
<p>
而Actor这种
</p>
</div>
</div>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul class="pager hidden-print">
<li class="previous">
                <a href="../scalaxue-xi-bi-ji/" rel="prev" title="scala学习笔记">前一篇</a>
            </li>
            <li class="next">
                <a href="../scalas-types-of-types/" rel="next" title="Scala's types of types(中文翻译)">后一篇</a>
            </li>
        </ul></nav></aside><section class="comments hidden-print"><h2>注释</h2>
        
        


        </section></article><footer id="footer"><p>Contents © 2018         <a href="mailto:abnerzheng@gmail.com">Abner Zheng</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         </p>
            
        </footer>
</div>
    </div>
    <label for="sidebar-checkbox" class="sidebar-toggle"></label>
    
    
    
            <script src="../../assets/js/all-nocdn.js"></script><!-- fancy dates --><script>
    moment.locale("zh-cn");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates -->
</body>
</html>
